input/images-source/LAB1-activity.plantuml
@startuml

start

:Select Genomic Test Order Form;
:Complete Genomic Test Order Form;
:Submit Genomic Test Order Form;

stop
@enduml
