input/pagecontent/LTW.md
```mermaid
sequenceDiagram
participant EPR as Order Placer
participant TIE as Intermediary<br/>NW GLH Regional Orchestration Engine (RIE)
participant LIMS as Order Filler 

EPR ->> EPR: Select Test Order Form
EPR ->> EPR: Complete Test Order Form

note over EPR,LIMS:IHE LAB-1 Laboratory Order
EPR ->> TIE: Send HL7 FHIR Message<br/>Laboratory Order O21
TIE ->> LIMS: Send HL7 v2 Message<br/>OML_O21

EPR ->> EPR: Collect Sample
EPR -->> LIMS: Send Sample
LIMS ->> LIMS: Update Test Order
```
