input/pagecontent/LTW.md
```mermaid
sequenceDiagram
participant EPR as Order Placer
participant TIE as Intermediary<br/>NW GLH Regional Orchestration Engine (RIE)
participant LIMS as Order Filler

LIMS ->> LIMS: Perform Diagnostic Test
LIMS ->> LIMS: Write Preliminary Report

opt
note over LIMS,EPR: IHE LAB-3 Laboratory Report (preliminary)

LIMS ->> TIE: Send HL7 v2 Message<br/>Laboratory Report ORU_R01
TIE ->> EPR: Send HL7 v2 Message<br/>Laboratory Report ORU_R01
end
LIMS ->> LIMS: Complete Report

note over LIMS,EPR: IHE LAB-3 Laboratory Report (final)

LIMS ->> TIE: Send HL7 v2 Message<br/>Laboratory Report ORU_R01
TIE ->> EPR: Send HL7 v2 Message<br/>Laboratory Report ORU_R01

note over EPR,TIE: When all tests in the order are complete

TIE ->> EPR: Task complete notification\n(Can be an email notification)

```
