input/pagecontent/LTW.md
```mermaid
sequenceDiagram

participant LIMS as Order Filler
participant Device as Automation Manager

LIMS ->> Device: Send Work Order Manangment LAB-4 O21
Device ->> Device: Perform Tests
Device ->> LIMS: Send Test Results Management LAB-5 R22/R32

```
